import { FeedbackStatus } from "@/shared/types/types";

type FeedbackMock = {
  email: string;
  id: string;
  date: string;
  status: FeedbackStatus;
  text: string;
}[];

export const feedbackMock: FeedbackMock = [
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "new",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "processed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
  {
    email: "ivanov.ivan@ivanov.ivan",
    id: "id4562368742",
    date: "01.03.2024",
    status: "viewed",
    text: "Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки. Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.Древний город с Кремлями, музеем космонавтики и красивыми парками у реки Оки.",
  },
];
