import { EventType } from "@/widgets/Calendar/model/types";

export const CalendarMock: EventType[] = [
  {
    id: "1",
    title: "Наполеон Бонапарт назначен командующим французской армией",
    date: "2024-05-01",
    cityName: "Калуга",
    text: "(18 февраля) 2 марта 1837 года за свое стихотворение «Смерть поэта», посвященное А.С. Пушкину, был арестован Михаил Юрьевич Лермонтов, и начато следствие по делу о «непозволительных стихах», за которым наблюдал сам император. Дата эта известна и хранится в памяти преимущественно людей мира литературы и искусства, тогда как само событие, повлекшее за собой арест поэта известно многим.",
    latitude: "55.77",
    longitude: "34.45645",
    routes: [
      "Космические выходные в Калуге",
      "КВВК 2",
      "Космические выходные в Калуге3",
    ],
  },
  {
    id: "2",
    title: "Наполеон Бонапарт назначен командующим французской армией",
    date: "2024-05-02",
    cityName: "Калуга",
    text: "(18 февраля) 2 марта 1837 года за свое стихотворение «Смерть поэта», посвященное А.С. Пушкину, был арестован Михаил Юрьевич Лермонтов, и начато следствие по делу о «непозволительных стихах», за которым наблюдал сам император. Дата эта известна и хранится в памяти преимущественно людей мира литературы и искусства, тогда как само событие, повлекшее за собой арест поэта известно многим.",
    latitude: "55.77",
    longitude: "34.45645",
    routes: [
      "Космические выходные в Калуге",
      "КВВК 2",
      "Космические выходные в Калуге3",
    ],
  },
  {
    id: "3",
    title: "Наполеон Бонапарт назначен командующим французской армией",
    date: "2024-05-03",
    cityName: "Калуга",
    text: "(18 февраля) 2 марта 1837 года за свое стихотворение «Смерть поэта», посвященное А.С. Пушкину, был арестован Михаил Юрьевич Лермонтов, и начато следствие по делу о «непозволительных стихах», за которым наблюдал сам император. Дата эта известна и хранится в памяти преимущественно людей мира литературы и искусства, тогда как само событие, повлекшее за собой арест поэта известно многим.",
    latitude: "55.77",
    longitude: "34.45645",
    routes: [
      "Космические выходные в Калуге",
      "КВВК 2",
      "Космические выходные в Калуге3",
    ],
  },
  {
    id: "4",
    title: "Наполеон Бонапарт назначен командующим французской армией",
    date: "2024-05-04",
    cityName: "Калуга",
    text: "(18 февраля) 2 марта 1837 года за свое стихотворение «Смерть поэта», посвященное А.С. Пушкину, был арестован Михаил Юрьевич Лермонтов, и начато следствие по делу о «непозволительных стихах», за которым наблюдал сам император. Дата эта известна и хранится в памяти преимущественно людей мира литературы и искусства, тогда как само событие, повлекшее за собой арест поэта известно многим.",
    latitude: "55.77",
    longitude: "34.45645",
    routes: [
      "Космические выходные в Калуге",
      "КВВК 2",
      "Космические выходные в Калуге3",
    ],
  },
];
